{
	"0": {
		"state": "Canada",
		"state_abbrev": "Canada",
		"location": "Alberta",
		"longitude": -116.5765035,
		"latitude": 53.9332706,
		"date": null,
		"summary": "About three years ago i encountered what I could only explain then as a deformed hyena. It was in the later part of the day under dusky condidtions and I was small game hunting at the time. I did not feel any fear because I was carrying my over-under shotgun at this time. It's eyes were kind of strange and I remember it had very pointy ears. It's head was almost cartoon like as it's snout had messed up over grown hair, it's fangs look unusaully long too. For sometime before I seen it I heard a very very long coughing noise, like a cat coughing up a fur ball. However this went on for a long time, so whatever did it had strong & large lung capacity. I doubt a lynx or cat could have been the noise maker. I have no idea if this dog like creature was the source of this strange and long coughing fit. Another strange thing along this trail, I always seemed to be under the watchful eyes of a high flying turkey vulture. Now these are newcomers to Alberta, but a few mating pairs have been reported up here, and this is common local knowledge that no one questions. This coughing bout I have heard at least oncve before in this specific area. Never seen the source in the nearby dense boreal forest. This wooded area is kind of on the edge of oil exploration and is an active work area now. So I don't hunt there anymore. Which is too bad as it's chalk full of small game such as rabbits and grouse. During this encounter the woods were un-naturally quiet. it's hard to move in many areas off trail because the ever green limbs reach so far close to the ground an upright person would be stooped over to move at any kind of speed in many areas. Quadrapeds have a definite advantage here over people, and the area is also ringed with swamps and marshy very uneven gorund that one could easily turn your ankle on. There were other strange moments then, I think when I did see this animal, I sat down on a large rock with my gun across my lap and caught the first glimpse, as it was circling me I think to catch my scent on the wind. I just caught a glimpse of it passing behind a tree in the dusky light conditions. It had hocks like a dog. But as it came around the tree, still on all four legs I noticed the front legs werre longer then the back legs, its back bowed upward and I got the distinct impression it's forntal back, chest and leg muscles were much more pronounced and muscular than it's back legs. I believe the front coat was a lighter color with some reddish tones too. Looked like a hyena loose in North America to my own eyes. It ws not a black bear. I am very familiar with bears. It was canine like, but not any canine I have ever seen before or since. My brother (he was not there) found a near perfect picture of another critter on line, on another crypto site, and the picture was said to be taken very near the Wisconsin River. In the picture it looked like it was on farmland corral or fenceline, in the early spring because of white and light snow cover. Was the near twin to what I saw that fall evening in Alberta. "
	},
	"1": {
		"state": "Canada",
		"state_abbrev": "Canada",
		"location": "Deadwood Alberta",
		"longitude": -117.458219,
		"latitude": 56.740963,
		"date": null,
		"summary": "I came across another report of a bipedal canine. I was at a Sportman's show here in Alberta & had been talking about Sasquatch with a group of people. After the discussion was over a young woman approached me and said that her father had seen \"a werewolf\" on their farm in the mid 1990s. She said that he was there at the show & she wondered if I would talk with him. I was more than happy to, as reports of bipedal canines are few and far between in Alberta. I was introduced to the father, who was less than happy that his daughter had told a stranger about his sighting of creature that isn't suppossed to exist. But after I told him who I was and what I did, he seemed relieved that I wasn't going to ridicule him. We went outside and sat at a picnic table, and he related the occurrence to me. Occurrence: The witness lives on a sizeable piece of land near Deadwood, Alberta. He raises, boards, and breeds horses for a living. One night in early August of 1996 the witness was awoken by the sounds of panicked horses; he said that they sounded as if they were being or were going to be attacked by something. He grabbed a 250,000 candlepower spotlight & a 20 gauge shotgun and headed out towards the sounds. It should also be noted that his dog refused to leave the house with him. This was very unusual, as the dog is trained for running off animals that may attempt to harm the horses. As he approached a corral were several shetland ponies were being kept, he spotted movement. He clicked on his spotlight and played the beam over the area, when the beam passed over a corner section of the corral he spotted what he thought was a large timberwolf. This surprised him, as he had never had problems with wolves before. Still, this \"wolf\" was making itself a problem, so he shouted \"Hey! Hah! Get the hell out of here!\" What happened next shocked and stunned him, the \"wolf\" spun towards him and stood up on its hind legs. He estimated that the creature's height was between 6.5 to 7 feet, the color was jet black, and the eyeshine was said to be greenish-yellow. He immediately pointed the shotgun at it and pulled back both hammers, when he did this the creature began to emit a growling sound\/vocalization that the witness described as \"A steady and somewhat guttural growling\". He remembers whispering to himself \"Oh my god. This isn't possible...\" over and over again. As he was doing this the creature started to go into a crouch, the witness took this to mean that the creature was going to lunge at him so he fired the shotgun in its direction. The creature dopped onto all fours and bolted, faster than he thought possible for an animal to move, in the forest. After the creature moved out of view, the witness began to get a very uncomfortable feeling like he was being watched. What he described as an unreasonable fear came over him and he fled towards his home as fast as he could move. He considered calling the police, but soon cancelled that thought. What would he tell them? That he had just fired at a werewolf? No, he kept this to himself, only telling his daughter when she was in her late teens. I asked the witness if he thought he hit the creature with the shotgun blasts. He believes that he did, but the damage would have been minimal as he was using #7 birdshot, the worst that may have happened was that the pellets caused it stinging pain. The duration of the sighting was estimated to be between 45 seconds and one minute. The distance from the witness to the creature was estimated to be between 40 to 50 yards. The witness only ever told me his first name: Lloyd. He also mentioned that if I ever used this report online or elsewhere, to change his first name to something else. The headache this would cause him in his small comminity is something he wishes to avoid at all costs. He seemed quite surprised when I told him that creatures like this had been spotted all over the United States & even in Quebec. The witness seriously thought that this creature was a werewolf, as he had nothing else to compare it to. He said that he lived in worry (if not fear) for a number of years afterwards, wondering if it was going to pay him another visit. He biggest worry was that it may harm his wife and\/or daughter. The creature was never sighted again by the witness, and no other similar reports have surfaced. I asked the witness if he thought this could have been a person in a costume, he gave a resounding NO to that question. He said it just looked too natural, and that the speed it moved with was something that a person in a suit could never accomplish. He also said that no one in the area would be foolish enough to pull a stunt like that, because the end result would most likely be them getting shot."
	},
	"2": {
		"state": "Canada",
		"state_abbrev": "Canada",
		"location": "Deadwood Alberta",
		"longitude": -117.458219,
		"latitude": 56.740963,
		"date": null,
		"summary": "I received a report about an unusual wolf\/wolf-like creature from a fellow this past summer. He was hiking the Mount Baldy trail here in Alberta when the encounter occurred. The behaviour of the animal was also extremely \"unwolf-like\", it was unresponsive & unafraid of things that a wild animal would be afraid of. Anyway, here is the report as I recieved it. \"I managed to get a few days off of work so I decided to hit some of the trails to do some hiking and exploring, I chose the trails around Mt. Baldy because I had been there many times before and knew them well. I was carrying a canteen of water, a small backpack containing a small first aid kit, a couple of well wrapped packaged snack bars, a small emergency survival kit & my digital camera. I was also carrying a 410 single-shot shotgun which I take with me on all my hikes & camping trips. I was about half of the way to the Mt. Baldy base trailhead when I was surprised by a very large wolf that just walked out on to the trail and stood there blocking my way, at first I was concerned because this creature was quite a bit bigger than any Timberwolf that I had ever seen, captive or wild. But the creature seemed content to simply stand and stare at me, I spoke to it & it didn't show that it had even heard the sound (no raising of the ears, etc), I yelled at it to get out of the way & it still did nothing. I began to feel uncomfortable so I started to back away, but the creature then came towards me. I stopped & so did it, I then took the shotgun off of my shoulder and fired it into the air, once again the creature did not seem to care. All it did was glance at the weapon, then right back to me again. By this time I had the nagging feeling in my head that this was not an ordinary wolf, it just did not behave like a wild animal, so I reached back into my backpack and removed my digital camera. This was the only thing that seemed to cause it to waver in its behaviour, for as I raised the camera to take a picture of it, it darted off into the woods. I took this moment to beat a retreat back down the trail towards a more open area. This next part may make you disbelieve the entire account, but I am going to say it regardless: When I looked back up the trail the creature was standing next to a large pine tree, but it was standing on its back legs!! I suppose it could have been using the tree for support, but it didn't look like it. I raised the camera once more and it disappeared back into the woods. Now what kind of wild animal is more afraid of a camera than of a gun?! This is why I don't believe I was dealing with an ordinary wolf, I may even go so far as to say it fringed on the paranormal. Needless to say I will not be hiking those trails ever again, armed or not. I know that you are a sasquatch researcher, but I couldn't find anyone else in Alberta that would know anything about this or even take the time to read it with out calling me a liar. I reported this large wolf to a **CO as I left the area. I told him that I had spotted an extremely large Timberwolf (easily the size of a Great Dane) on one of the trails, he replied that the wolves here don't get that big & that I must be mistaken. He probably thought I was a kook. And just a side note, I know for certain that this was not someone's escaped dog. It was a wild creature, it looked rough & had a feral look to it.\" "
	},
	"3": {
		"state": "Canada",
		"state_abbrev": "Canada",
		"location": "Deadwood Alberta",
		"longitude": -117.458219,
		"latitude": 56.740963,
		"date": null,
		"summary": "In this report a husband and wife were out cross-country skiing. They had just crossed a remote country road & were about to ski across a field. On the other side of this field they spotted an extremely large wolf standing just inside of the treeline, the wife said she felt uncomfortable as the creature was staring right at them & following their movement. Her husband was carrying a .22 rifle on his back (on a sling), he brought the rifle down, chambered a cartridge, and fired into the ground in front of the creature. She said that the creature looked at the ground, then back at them, and began to growl. She said that the growl \"went up and down in sound\", and it was very deep & menacing. She said that her husband shouldered his rifle again but did not fire, what really gave her the chills was the look on the creature's face. She felt that the creature knew that the rifle was small caliber & was not something that could kill it with one shot. Moments later her husband fired again, this time into a tree that was next to the creature. The creature didn't even flinch, but what it did next made both of them flee in terror. About 30 seconds after the second shot, the creature stood up on two legs. One of its front legs (arms?) was against the tree that her husband shot. The growling continued, but it had increased in volume by quite a bit & the creature was moving its jaws up and down, like it was gnashing its teeth. Her husband fired three shots directly at the creature, all three hitting it in the chest. The creature let out a drawn out scream\/howl and ran off into the forest on two legs, they fled the other way back towards their vehicle. As they were skiing back they had to pass through a small area of forest, as they were passing through the forest they could hear something running towards them from a distance through the woods. They cleared the woods without anything happening, but when they broke out of the forest they estimated that whatever was chasing them was no more than 35-40 yards behind them. She had her cell phone with her & was thinking about using it to take a picture of the creature. As she was thinking this she suddenly got a \"feeling\" that if she took a photograph, the creature would kill both of them. She said that the feeling was so strong that she immediately shoved the phone in her pocket. It wasn't as if the creature sent her a psychic message or anything, it was just a feeling. One thing she mentioned, in a hushed, embarrassed voice. When her husband and her made it back to their vehicle, she noticed that she had actually peed her pants. She didn't even notice until the adrenaline rush ended. She had actually been so scared that she lost control of her bladder, she always thought that was \"just something from the movies\". \n -Location: Crowsnest Pass, Alberta (near the Town of Coleman).\n -Date: December 1\/ 2012.\n -Creature's color: Dark black.\n -Height, 4 legs: 3 - 3.5 feet.\n -Height, 2 legs: 6.5 - 7.5 feet.\n -Sighting duration: 1 minute to 1.5 minutes.\n -Sighting distance: 65 - 70 yards.\n -Time of day: 11:30 am - 12:30 pm.\n -Weather conditions: Cold, overcast, no wind, chance of snowfall. "
	},
	"4": {
		"state": "Canada",
		"state_abbrev": "Canada",
		"location": "Gillam Manitoba",
		"longitude": -94.7748443,
		"latitude": 56.33341,
		"date": null,
		"summary": "I saw something that put a big scare into me. I'm going describe it - not sure you'll believe it, but I'm certain about what I saw that day. This happened in August 2009 as I was driving to my husband's place of employment. We live in Gillam, Manitoba and he is an electrician for one of the generating stations on the river. It was close to 3 PM. I had just turned off one of the residential roads near my home head-ing east on PR280. About a 1\/2 mile after my turn, I caught a glimpse of something tall moving through the trees to my right. Then sudden-ly, it jumped onto the shoulder of the road and stood there as I drove by. I looked in the mirror and saw it quickly cross to the other side of the road. I picked up speed and didn't stop until I reached the station. I had chills all over. I got a decent look at it. It had a large wolf head, but it was standing upright on legs which looked man-like. I didn't see arms as I passed by, but I did see arms swaying back and forth when I looked in the mirror as it crossed the road. The coloring of the head and body hair was charcoal with darker patches. If it was an actual gray wolf, then it was the largest one I had ever heard of. I thought that someone was playing tricks, but that wouldn't make sense since (I think) it was during the hunting season. I did tell my husband, who later checked the area where I saw it. He said that there were reports of a very large wolf along the river a year or two before, but he had not heard anything beyond that. I still don't know if he believes me. I also said something to my uncle (through marriage) who is Chippewa. My uncle told me that it was not a ma'iingan (wolf) and that I must for-get about it. He then recited some words under his breath and told me not to mention it again. That kind of freaked me out. Since it was 5 years ago, I haven't thought much of it - until I read a newspaper article about the dogman and sightings people had in other locations. "
	},
	"5": {
		"state": "Canada",
		"state_abbrev": "Canada",
		"location": "Léry Quebec",
		"longitude": -73.8059179,
		"latitude": 45.3444129,
		"date": null,
		"summary": "An old friend and I cross the path of a dogman in the Centre écologique Fernand-Seguin in Chateauguay, a city situate in the province of Québec just at the south shore of Montreal. One week before our encounter, without knowing about it not until after our own encounter, the father of my friend encounter one in Lery, a town next to Chateauguay and connected to the natural park. The Chateauguay sighting happen during the summer of 2005, but for a long time, i always believe it was 2008 (( because i am bad at remembering date )), but my friend ((the second witness)) have recently refresh my memory about it. I am telling you that because i have already fill a report a couple years ago which can be found on this map written in a terrible english, with the wrong year and some missing information the father of my friend didn't tell us at this point ; https:\/\/www.google.com\/maps\/d\/u\/0\/viewer?mid=186_7hq4gxioA6hHZLmaWpCJWCng The chateauguay encounter ; the creature have following us all along the border of the forest in the entrance zone of the park, doing weird canin sounds, like it was upset or something, We managed to keep our calm the much we can and heading to the car which was at the fence directly at the entrance door of the natural park. At the moment we enter the car and my friend open the light of the car, my friend saw a 6 foot tall dogman looking right at the him at the other side of the fence, like at 2-3 meter from his car door. He only saw some of its facial feature and the eyes shines. (( Don't ask the color, he is daltonian..)) It was enough to get afraid like hell and move the car away of there. I never managed to saw the dogman directly and the creature didn't follow us after we departed. Lery sighting. which happen 1 week ish before our encounter ; The father of my friend and the ex-boyfriend of the sister of my friend get out of their chalet one night after hearing a weird commotion behind the chalet. ((By the way, the Chalet is build at the edge of a very big marsh, which connected to the natural park. )) My friend was there that night, but he didn't exist the chalet only at the end of the encounter. When the two of them arrived behind to find out what cause all of the noises, both of them saw a very large black dog, with large shoulder, eating something in the brush at 6-7 meter of them. The creature turn away and face them rapidly and begin to growing at them. The father follow up his instinct and get a large stick near of him and prepared himself for the worse. At this very moment, the creature stood up, make a very small step or two toward him continuing his growling. The father was shocked up from the scene and his daughter-boyfriend become white like a ghost. Few seconds after, the dogman step aside very fast, return on all four, run a very short distance to jump directly into the marsh to dissapear forever. My friend finally exist the chalet to join his father and his sister boyfriend only when the dogman escaped on all four, so for him at this time, it was only a very strange large dog. His father and the now ex-sister boyfriend NEVER tell to my friend the dog creature have stood up until my friend get his own encounter with me 1 week later. Since then, we speculated all of us have saw the same dogman or maybe a member of the same pack because of the forest connection between the natural park and his chalet. My friend family never saw any dogman again around the chalet since this summer, so we dunno if it was only passing by the sector that summer or it living around the sector but generally avoiding humans at all cost OR the peoples around don't want to talk about it to anyone. I don't have any other eyewitness of dogman in this natural park...maybe it was happen but i guess peoples will never dare to speak about it."
	},
	"6": {
		"state": "Canada",
		"state_abbrev": "Canada",
		"location": "New Brunswick",
		"longitude": -66.4619164,
		"latitude": 46.5653163,
		"date": null,
		"summary": "My grandfather told me this story when I was a teenager. I’m 52 now. My granddad grew up in the woods of Central New Brunswick, in a very remote area, where only survivalists go now. Their whole family lived out in the sticks. They lived by hunting, fishing, trapping, and some logging.\n\nGranddad said, when he was a teenager, he and his older brother, Duke, were up, in the early hours, checking traplines, on an old motorbike. it was early fall. Frost was on the grass and early morning mists still hung around the forest edges. He was rolling cigarettes with his brother and they were out of matches, so they dipped a bit of cloth in the gas tank and ignited it off the coil wire, while duke kicked the bike over. The sound of a bike being kicked over, without an ignition, is sort of like an animal call. That’s how my granddad described it. Anyways; just as they started smoking their cigarettes, my grandfather noticed something bounding through the tree line, toward them. Granddad said it ran in a way a bear did, but it stopped several yards away from them and stood up, on its hind legs. It was still too far away to tell what it was, but they assumed it was a black bear because they are very common in New Brunswick. That’s when it began walking, upright, toward them. As it got nearer, Granddad said it looked like a huge Werewolf! His family origin was German, so this was not unknown. it got as close as 20 feet away from them and then began to eye them closely. It sniffed their smokes and then turned and hopped\/ran back to the trees. Granddad said they were not scared. He said they were only shocked that such a creature was living in the woods. Granddad said it was taller than any man, had a huge head, evil eyes, long, upright ears, hands with long claws, and had hair all over its body. I can’t remember what color he said its fur was, but he said it had wolf like legs."
	},
	"7": {
		"state": "Canada",
		"state_abbrev": "Canada",
		"location": "Ontario",
		"longitude": -85.3232139,
		"latitude": 51.253775,
		"date": null,
		"summary": "I was driving home from work on a 6-lane highway, heading west into Hamilton, Ontario. As I drove, on my side of the highway, I saw a dog cross from the left side to the right. That area is full of trees, bushes, channels, and ravines of water that are off-shoots of Lake Ontario. When I saw the dog, it was approximately 1\/2 of a kilometer ahead of me. The astonishing aspect of this dog (I’m certain it was a dog) was that its length from nose to rump (excluding its tail) covered almost the full width of the lane. 8 FEET!!! Where it was heading was back into a small valley filled with heavy forestation and a ravine. I couldn’t believe a dog could grow to that size.\n\nI still remind my boyfriend of this occasionally. I have no witnesses."
	},
	"8": {
		"state": "Canada",
		"state_abbrev": "Canada",
		"location": "Saint-Georges, Quebec",
		"longitude": -70.670352,
		"latitude": 46.1229184,
		"date": null,
		"summary": "\n\n\nIn June of 1995 a man sightseeing in Quebec snapped 76 photos and made 4 videos of an area known as Parc des 7 Chutes, or Seven Chutes Park, near Saint-Georges de Beauce, Quebec. As he browsed through the pictures, some-thing odd caught his eye in photo num-ber 32. There appeared to be some-thing strange standing amid the trees. When the photo was enlarged, a tall brown figure with a baboon like snout becomes clearer. Not only that, it seems to be clutching a white dog, and appears to be staring towards the photographer. He had not seen it when he took the pictures. The photographer (who wishes to remain anonymous) went back to the area and had photos taken with a man standing in the same spot for com-parison, as well as to see if there could be another explanation. Some skep-tics have suggested it is a rock formation but the subsequent area photos do not support this theory. Others claim it's simply a case of pareidolia, the phenomena of seeing faces or other distinct images in objects such as clouds, tree formations, or even a cinnamon roll. Remember the famous cinnamon roll that had the uncanny likeness to Mother Theresa of Calcut-ta? There seems to be more than that to this particular image, however. So what is the thing, and why is it holding a small dog? If it's a bigfoot, it doesn't match up with most descriptions by bigfoot eyewitnesses. This ani-mal has a snout like a dog or wolf, leading some to call it a \"Dogman\" or a werewolf. \n\n\n"
	},
	"9": {
		"state": "Alaska",
		"state_abbrev": "AK",
		"location": "Matanuska Valley",
		"longitude": -149.2535787,
		"latitude": 61.5775642,
		"date": "10\/27\/1998",
		"summary": "10\/27\/1998 - My encounter took place many years ago. I never had the faintest explanation for it until a couple months ago, when I randomly stumbled across Dogman on the internet. I was in my early 20s, working swing shifts at the time and commuting about 100 miles each way, so it was usually around 2:00 in the morning by the time I got home. I saw the 'monster' (as I called it) on the northern-most section of Trunk Road in the Matanuska Valley, in Alaska. This area is roughly smack in between the towns of Palmer and Wasilla. I was only about 10 miles from home at that point, so it must have been around 2:00 a.m. Trunk Road is a narrow, 2-lane road, consisting of nothing but twists and turns. The surrounding terrain is somewhat swampy and thick with black spruce. It was late October; days before Halloween. There was no snow on the ground, but it was cold enough to be wary of ice. I was driving an '82 Subaru SW, going about 20 MPH around a curve, when my headlights caught a large, dark figure up ahead. I'm bad at judging distance; maybe 6 car lengths away. I instinctively let off the gas, coasting closer. At first I assumed it was a moose, as the area is infested with them; but no, it was standing upright. Bear, then. No, not a bear. It looked so strange... tall enough to be an uncommonly large bear, but far too slender, and it looked like it had spikes running down its neck and back. A Halloween prop? Odd but effective place for one. All those thoughts ran through my head in a fraction of a second. The car was still coasting closer and I could see more details; it was standing in profile, gazing across the road. I could clearly see its wolfish muzzle, large, upright ears; the 'spikes' on its back were in fact clumps of fur. Its spine curved in a smooth, very natural-looking way. It was standing in the ditch, inches from the pavement. Because I was focused on its upper body, I do not recall anything about its back legs or if it had a tail. I did see its front legs though; very 'doggy' looking, hanging awkwardly down and slightly toward its front, exactly as you'd expect if a dog stood upright. While it clearly had a canine look, there was still something 'off' about it that I cannot articulate. It was perfectly still, and at this point, given the proximity to Halloween, I was quite convinced it was some sort of Halloween prop, because it was clearly not any kind of existing animal. I was deeply impressed and gently stepped on the brakes, intending to stop and examine it closely. Then it turned its head towards me. In the tiny fraction of a second that it took for it to swivel its head, I knew I had made a terrible mistake. The fluidness of its movement removed any and all doubt that this was some kind of prop. It was horribly, terrifyingly alive. The pale, off-white glow of its eyeshine in the headlights destroyed any possibility of a human in a costume. I think I sat there gaping at it in shock for a few seconds, the car barely moving by now, but still inching closer. As I was almost upon it---I think it could have leaned forward and touched the car if it had wanted---I had to look up to see its face; again I'm a bad judge of such things, but I am 5'4\" and it was a hell of a lot taller than me. Tall like a polar bear standing. 7 feet? 8? I really can't say. I snapped out of my trance and slammed on the gas. The car fishtailed and I prepared myself for death-by-monster, as I was certain I'd end up in the ditch, but the tires caught the pavement and I drove like a complete maniac all the way home. I did not look back. I have only been on that section of road a few times since, never alone and never in the dark. For the next several years of driving that commute, I went 20+ miles out of the way to avoid Trunk Road. The thing never made any aggressive moves, but there was something about it that felt very... I don't know... predatory. I never saw anything remotely like it again and never heard any stories about it in the area."
	},
	"10": {
		"state": "Ohio",
		"state_abbrev": "OH",
		"location": "Akron",
		"longitude": -81.5190053,
		"latitude": 41.0814447,
		"date": null,
		"summary": "In January of 2010 a good friend of mine Robin V. Of Munroe Falls Paranormal Society contacted me about a rash of sightings of a werewolf type creature running out of a metro park crossing traffic. Upon talking to witnesses, All of them described it as a werewolf\/Dogman. I went to the offices of the metro park district to ask about the sightings of the Dogman that have been reported in there parks. Their comment to me was “We don’t like to talk about it”. They are aware that there is something in the park, they’re just not sure what it is exactly. I left contact info in case of more sightings. About a week and a half later I received a call from a friend about a sighting from one of the park rangers. I met up with him the next morning He stated that he was getting back into his vehicle and looked off to the left and seen what appeared to be a dog on all fours, he got into his vehicle backed up and when the headlights shined on the dog it stood up and looked at him for a brief moment and walked away on just two feet. The ranger took me to the sight were he saw the creature standing, there were fresh tracks in the snow. I counted 168 tracks coming out of the deep woods to where the creature was standing and tracks from where it was standing to out of the park across the road. This is still an ongoing investigation. "
	},
	"11": {
		"state": "Ohio",
		"state_abbrev": "OH",
		"location": "Athens County",
		"longitude": -82.12784,
		"latitude": 39.3030308,
		"date": null,
		"summary": "Date Unknown - My girlfriend and I were driving down a remote, country road, in the early summertime, late one evening. She was the one driving. I was in the passen-ger seat. The sun was setting behind us. We had just come around a curve, when 2 does jumped out onto the road in front of us. They acted like we weren't even there. They seemed to be focused on something else. So she jammed on the brakes and brought the car to a stop. I told her, \"Man! That was close!\" That's when I looked up into the rearview mirror, to see if any more deer were coming. When I did that, in the red glow of the car's tail-lights, I saw some THING take a big step into the road, from the brush that was on the side of the road. Whatever it was, landed on its right leg, when it did that. Looking at it in the rearview mirror, I could see it from its mid-thigh, up to its stomach. In one motion, it then took another step forward and put what looked to be a hand down, on the trunk of the car, to appar-ently balance itself. When I saw that, I turned to look at my girlfriend. She was wide-eyed, her mouth was wide open, and she was white as a ghost! I could also see that her eyes were tearing up. So, I looked back, but by that time, it had already gone across the road. In an attempt to get a better look at this thing, I opened my door and got out of the car. When I looked, I could see that it was going down the embankment that was on the side of the road. Because of the brush, I could only see it from the armpits up. It was at least 7 feet tall and had very wide shoulders. Its shoulders were at least 1 1\/2 times as wide as my shoul-ders, and I've got wide shoul-ders for a guy. From the last bit of daylight left, I could see that it was black or dark brown in color and had point-ed ears on top of its head, like a dog. Its ears weren't overly wide, or fuzzy. Its head was kind of dome-shaped, more or less, with flat sides. It acted like we weren't even there and seemed to remain focused on the deer. I was thinking, \"What in the world is this thing?\" It looked like some kind of Werewolf or Wolf man to me. It was WAY too big to be a person. Through that whole ordeal, I never did get a chance to see its face. In the area where we saw that thing, people have reported being paced in their vehicles, going down the road, by creatures that look like what we saw."
	},
	"12": {
		"state": "Ohio",
		"state_abbrev": "OH",
		"location": "Canton",
		"longitude": -81.378447,
		"latitude": 40.7989473,
		"date": "11\/23\/2016",
		"summary": "11\/23\/2016 - After digging into what I had seen on google, I had come across your name associated with the words \"dog\" and \"man\" .. along with werewolf Ohio several times. I am a sales rep for the Ohio, West Virginia, and Pennsylvania region with an office in Canton, Ohio. Being a city boy it is often intriguing and interesting to be out and about in the the country... With my job I often find myself in new places and always seeing thing I never thought I would! That is until Tuesday November 23rd ... this day I found myself following my gps down a dirt road in Lisbon Ohio, listening to the local radio station out of Akron ranting about The election.. My suddenly caught a man in a black fur coat running across a field.. first about ten feet away then in what seemed a flash he was halfway across it before I had time to realize this was NOT normal... I slammed on the brakes and grabbed my phone to take a photo but I hadn't enough time to fire off a good shot.. (the picture attached is what I got) This thing was at least 7ft tall and fast as HELL! Black, and I noticed what I later thought must have been long pearly white teeth in a row as it ran.. I do remember two distinct ears high on it head. It was for SURE on two legs but appeared to be a giant ... dog\/man of sorts"
	},
	"13": {
		"state": "Ohio",
		"state_abbrev": "OH",
		"location": "Clermont County",
		"longitude": -84.1857115,
		"latitude": 39.0928449,
		"date": null,
		"summary": "May 2016 - A male employee (approx. age 62) of a water treatment facility on the east side of Cincinnati was making a nightly round to drive to a particular tank and open a valve. Driving down a rural road dotted with houses, he sees on his right something standing in front of a garage, lit by a bright overhead light. He put his truck in reverse and backed up to get a better look, stopping at the foot of the driveway.  The creature was standing about where the SUV is parked on the right. Image on the right shows the light pole, directly across from the basketball hoop. I was told there is another light that brightly illuminates up near the garage door, but I could not see it from my vantage point. The driveway is about 50 ft. long. These images were shot from inside a car, just like the witness would have seen. I blotted out the house and license plate numbers for privacy of the residents, who were not interviewed. I wonder if they have any idea what lurks around their house at night.The witness describes a bizarre creature he estimates to be about the size of a man. It was covered in brown leathery skin, but had regular animal hair on the head, neck and chest. He describes a canine head with a long muzzle and pointed ears on top. He reports that the legs were dog-like, but the arms appeared man-like. Interestingly, the creature stood in an unusual pose, likening it to this type of yoga position called intense side stretch.The witness said that instead of forming a V shape as in the woman pictured, the creature’s legs formed more of a horseshoe shape. If they were canine type legs, one can easily see where this would make sense. The creature’s arms hung down in front, but I don’t know if it was touching the ground or its own foot or what. \nEerily, the creature did not move, but eyed the witness with just one eye, keeping its head in profile. The witness reports a sort of sneer on the creature’s face, as if to say, “You see me, don’t you?” He said the overall feeling about this creature was that it was “bad news”. \nHe and the creature stared at each other for about a minute, with the creature remaining in place just looking at him. At length, the witness drove off to attend to his duty up the road. When he returned about 8 minutes later, the creature was gone.  I was taken to the water tank employees must attend every morning at 4 am. As the crow flies, this tank is only about a hundred yards from where the sighting took place. This is where the witness was headed at the time of the sighting. The employee comes out here alone each morning at 4 am, drives up to the locked gate and opens it, then walks into the enclosure and opens a valve on this tank. On the right side of the driveway is a dense hedge of trees and honeysuckle. On the other side of that hedge is a small field with outbuilding and parking lot, then the road and on the opposite side of it, the house where the sighting took place. On the right hand side of the tower is mostly farmland. One is pretty alone in the dark at this tank. My friend noted that going into the gate to the tank isn’t bad, but coming back your headlights are in your face and it’s hard to see. \nFor some time now, prior to the sighting, the witness has been expressing his uneasiness coming to this particular location. He said he always feels like something is watching him. I have been assured that this witness is anything but a coward and is actually a bit of a “bad ass” type. But he has long been uncomfortable coming here in the dark. \nThe locations of this tank, the water treatment facility and the sighting are very near a state park and a wildlife area, a lake, a large creek and railroad tracks. \nUnfortunately, I’ve yet to get permission from the witness for a direct interview, but I’m still holding out hope. This information comes from my friend, who works with the witness.  "
	},
	"14": {
		"state": "Ohio",
		"state_abbrev": "OH",
		"location": "Clinton County",
		"longitude": -83.8473015,
		"latitude": 39.4067432,
		"date": "7\/21\/2016",
		"summary": "7\/21\/2016 - I was driving my girlfriend home from work. Both of us lived in a suburb of our small town, so the drive from her workplace is relatively short. The only off thing about our encounter was the fact we saw it in a suburb, as opposed to the wooded or rural areas, like other encounters. The moon was full, so we had a lot of light to see, but there were many mature trees in the yards of the houses surrounding the road we were driving on. All we saw was a large black blur, moving very fast. Almost as fast as a greyhound, at full speed. The length of the blur made me estimate it to be 6 to 7 feet. Both of us were shaken by the experience and headed home immediately. When we got home, my girlfriend and I recanted our experience with her family, who laughed at us for telling them we had seen such a thing. They brushed it off as a tall tale and went on with their nightly activities. \n \nMy girlfriend's two younger siblings were planning on playing a game called Manhunt. It's pretty much just like hide and seek. When the two of them headed out, not even two minutes after they walked out the door, they both bolted in, clearly upset and shaken. They both said they saw exactly what my girlfriend and I saw, but when they saw it, it was walking on its hind legs, under a street lamp. Because of that, they got a clear view of it. They said it was dog-like and was walking on its hind legs, on the street. After hearing that, we all as a group of witnesses, headed out in my car, to search for the beast and to warn the other kids playing Manhunt about the beast. My girlfriend's siblings have stopped playing Manhunt after their experience and now that we all have a name to what we saw, we are all more shaken wondering if it will be back"
	},
	"15": {
		"state": "Ohio",
		"state_abbrev": "OH",
		"location": "Fairfield County",
		"longitude": -82.6483442,
		"latitude": 39.830506,
		"date": "5\/19\/2004",
		"summary": "5\/19\/2004 - One night, I was out in the woods hunting, around 1:00 AM and found this weirdly mangled deer carcass, near a tree. About 1 hour and 50 minutes later, I was walking back to my truck, when I saw that it was shaking violently, so I readied my rifle. I then saw that it was a bear-like creature shaking my truck. It stood up on its hind legs and growled at me, before running off, into the woods.\n\nWhen I got a look at the creature, it had long arms and its claws were around 3 inches long. It had pointed ears, like a German Shepherd, muscly shoulders and legs, and a wolf-like snout, with a short, nub tail."
	},
	"16": {
		"state": "Ohio",
		"state_abbrev": "OH",
		"location": "Franklin County",
		"longitude": -82.9931607,
		"latitude": 40.0154745,
		"date": null,
		"summary": "I was 11, I was staying up all night, playing video games, when I heard something outside, in the bushes. I was paranoid and the blinds were wide open, so I looked outside and saw reddish, orange eyes. I could also barely make out a face, with a snout. I fell back in fear and heard a howl outside and then footsteps getting further away when I got back up. 2 minutes later, it was gone.\nAnonymous Time: 2 AM Date: May or June of 2013"
	},
	"17": {
		"state": "Ohio",
		"state_abbrev": "OH",
		"location": "Germantown",
		"longitude": -84.3693882,
		"latitude": 39.6261682,
		"date": null,
		"summary": "Myself along with four other guys decided to go park on Anthony Rd, and walk out to the middle of a field to drink some beer. We lived in a small town and not much to do (keep in mind however that we hadn’t yet started drinking and even if we had I don’t think it would have caused a group hallucination).\nThe reason we had guns was due to an incident prior to this were my female cousin and her friends, whom were all about five years younger than us came back to my aunts house one night really scared and said that they were driving down Anthony Rd, and a guy was lying in the middle of the road, so they had to stop the car, It’s a narrow road so they couldn’t turn around and so they put the car in reverse to back up. Just then the guy in the road jumped up and started chasing the car, and people came out of the cornfields and tried to open the car doors and trying to stop the car. They took off in drive and came back to the house and told us what happened. Hence the presence of guns the night of our encounter.\n \nThe night we had our encounter was a very bright night. A full moon (or near full), shone down on some pretty thick fog that was about shin high, so visibility was quite high. We drove up and down the road 1 time just to make sure no cops were parked on the road anywhere, then we spotted the field we wanted to go into. It was really cool looking with the fog laying heavy on the ground and the moon bouncing off of it giving a really cool glow effect. We parked the cars (two cars), and began to venture into the field at the area tractors would enter. We walked about maybe twenty or thirty yards in and stopped to listen for cars coming, and also to just listen to the woods to make sure no one else was around.\n \nOne of us noticed something large and dark along the wood line to our right about 150 yards out into the field. We all stopped talking and watched it for a few minutes trying to determine what it was ( a tree stump, large rock, bush ect). After a few minutes we decided it was just a big bush and stopped paying attention to it and walked further into the field. After going into the field a little more one of us noticed the object wasn’t there were we had seen it before. We began to scan the area to see where it went and then we noticed something running from right to left across the field in front of us. It looked to be about three feet above the fog line (if not four feet). So that would make it bigger than any dog. The mechanics of how it ran reminded me of a cheetah or greyhound dog, reaching out with long forelimbs to grab the ground and then hurling its hind haunches under itself to spring forward yet again. It’s silhouette looked like a wild boar or hyena (it had the stereotypical large hump on its upper back). It ran really really fast to the center of the field and then turned directly towards us. I’ve never seen anything able to cut a different direction as fast as this thing did, especially considering how fast it was traveling. At first we thought it had stopped running, but then after a second we were able to tell it was now coming straight at us. We were all asking\/commenting with each other trying to reason what it was (dog, cougar, bear, ect). As it continued it’s charge we raised guns at it. I had a shotgun and two of the other guys had pistols. When we raised our guns it began to zig zag. I remember thinking that it knew what guns were. I remember saying (or one of us said), that thing knows we are pointing guns at it. I think that’s when we got creeped out enough to run for the cars. MY buddy ( the facebook guy) said he didn’t shoot because he couldn’t identify the target. I personally (and am not ashamed to say) think it is because we all got scared because we knew it wasn’t any known animal. It was moving so fast that I thought if I miss, or if my first shot doesn’t stop it, I wont get a second shot. Shotguns are only good within certain distances and I didn’t want it getting that close to me. As we were running away my friend at the time fell into a groundhog hole so I had to run back and help him up so we could get to the cars.\n \nGiven how fast it was running, I don’t think it was really trying to catch us or it would have. When we got to the cars and took off, I recall looking out the side window and this thing was chasing the cars. Once we got over the little bridge on Anthony onto Manning road we were able to get up more speed. I don’t think it ever came out of the field or crossed the bridge however. It’s as if it just wanted to chase us off.\n \nIt never stood up on two legs and I didn’t notice any eyeshine (I think it may have been too far away when it started its charge to see the eyes). I can tell you that it was bigger than any dog and much much faster. It was able to zig zag really fast, like a rabbit. It was very jerky in it’s side to side movement. Almost twitchy I’d say. I got the feeling that it was so quick and agile that I might not be able to get a bead on it to get good hits on it with the shotgun. As we were pulling away in the car is probably when I got the best look at it. It had odd body mechanics as it ran. It reminded me of a cheetah and I could tell the forelimbs were longer than the hind limbs. I couldn’t see a tail or the shape of the ears however."
	},
	"18": {
		"state": "Ohio",
		"state_abbrev": "OH",
		"location": "Lewisburg",
		"longitude": -84.5396736,
		"latitude": 39.8461629,
		"date": null,
		"summary": "2017 - My girlfriend and I had a sighting along Rt 40, just north of Brookville. The sun was up still, a little before sunset, thin high clouds, so plenty of light. I was driving, and she was looking at me as we were going west on 40, just talking, when I see her eyes go wide, looking past me through my window; and she practically screams \"What the hell is that!?\" and points across the field we're traveling parallel to. I look to my left, and see something huge and black, with a massive upper body running like a bat out of hell along the edge of the woods.\nShe watched it for a good 30 seconds, running along the edge of the woods until we lost sight of it when we passed a house close to the road. She kept going on about it half panicked and excited until we got home (about 3-4 minutes to the house from the point of the sighting).\nFinally, we get home and I asked her what she saw exactly, and she said it was a big black thing that was running faster than any deer or human could move, big upper body, couldn't see any major detail due to distance across the field. she said \"It was one of those things, wasn't it?!\" I introduced her to the NADP site after the encounter, but I had asked her about seeing anything strange up that way in the past, animals acting oddly, coming up missing, etc. which she had confirmed happening over time"
	},
	"19": {
		"state": "Ohio",
		"state_abbrev": "OH",
		"location": "Lodi",
		"longitude": -82.0120908,
		"latitude": 41.0333889,
		"date": null,
		"summary": "Was in 2001. Me and my daughter heard at high pitch scream woman peacock sound. In seconds heard. Heavy mental moving. This thing was pushing big air conditioner. Then it jumped on it. Swayinging back and forth then it leaped in seconds heard sound again like it was a mile away. It thing was white with long hair and tail. Legs short long as 7 feet weight about 400 pounds. It look like a polar bear ...gorilla..wolf..man in one... Reported it to Lodi police. others have seen it too. Reports of this thing fifteen years before we seen it... Then in 2008. Liz boyfriend was with us.. Again seen it on Rt.42 coming back from Mansfield..."
	},
	"20": {
		"state": "Ohio",
		"state_abbrev": "OH",
		"location": "Logan",
		"longitude": -82.4070986,
		"latitude": 39.5400672,
		"date": null,
		"summary": "Report submitted - March 27th at 3:30PM             I was hoping you may be able to help. my research partner and me have a bit of a problem with a dogman at his cabin here in SE Ohio. we have been researching the ohio grassman for about 2 years together. well no we have this dogman really becoming a problem. since january 3rd of this year, this thing has been pissing on his cabin about 4 ft up in various spots. it has taken a frontal bite out one of his trees, it slashed one of them. it hangs out in the wee hours most nights growling all around his cabin. we have it on video, audio snd trailcam, so we know what we are dealing with. we are just asking for some advice on how to deal with it. this place where his cabin is, is a campground that is primarily closed for the winter. there are handful if year round residents, but a total of maybe 8. it is opening up for the season now and we dont want anyone getting hurt. it is more of an upright dog than a wolf. he is getting more aggressive with time. my partner being an ex army ranger does not scare easily, but this thing finally wore him out to the point he left his cabin and went back to his home stead to regroup. our thinking at the moment is to try snd take it out. we started on a plan that we think will work, problem being we think there is more than one. the are grassmen all around this area, we have them on audio and photos, but neither is deterring the others. any advice you have would be greatly appreciated. we don’t really want to kill it, but its getting to that point. we also dont want to draw attention to the area. the last thing we want is s bunch of people running around looking for it. thanks for your time. "
	},
	"21": {
		"state": "Ohio",
		"state_abbrev": "OH",
		"location": "Mansfield",
		"longitude": -82.5154471,
		"latitude": 40.75839,
		"date": null,
		"summary": "\n\n\nJune 2017 - Last week my son, Kaden, was in Ohio and saw both a sasquatch and a Dogman on our uncle's families property, to be exact, it was his brothers. The brother, Rocky, has been hearing howls coming from the woods and has shot into them several times. My sons cousin, Jersey, also saw a Dogman walking towards Rockys house and they saw shadows at the family cemetery. I'm trying to get permission from them to investigate. Kaden says when hes deer hunting he hears walking, knocks, grunts and growls. A year or two ago, something scared the Alpacas or Llamas our aunt had, on her part of the property, and when the one was found, it was torn apart--they said a bear did it, I believe otherwise from what I was told. He did send me this picture of a tree."
	},
	"22": {
		"state": "Ohio",
		"state_abbrev": "OH",
		"location": "Morrow County",
		"longitude": -82.8007993,
		"latitude": 40.5303751,
		"date": "10\/27\/2017",
		"summary": "Name:\nDebra\nReport Title:\nToo close to home\nDogman Sighting details::\nMy mother just told me that a few days ago on her way to work (5am), she saw red Red eyeshine in the corner of her eye from her headlights. She tried to look at what had caused it, but what she saw made her shiver. The creature was about my father's height (6 ft or more), and had turned towards the cornfield after looking at my mother's vehicle from the side of the road. As she passed it all she could see was the backend. She described it as a naked man with dark gray or black wolf hair, no tail. After she passed she kept watching it and saw it turn it's head to watch her, but it did not turn its body like a Bigfoot would, its body was still. She said she saw incredible intelligence but also felt evil. A few months prior on my way home from work (11:30pm) I saw red eyeshine and then a large creature speed across the road about 3-4000 yards in front of me. It had black fur, a long muzzle with a large head, broad shoulders with what seemed almost like a mane around it, large and long front and back legs at a strange angle, no tail. When it happened the first thing that popped into my head was an impossible wolf and wild boar mix. At the time I didn't know about Dogman but after learning about him, that's what that creature had to be. This all happened in Morrow county Ohio. Another sighting happened last week outside of Mt. Vernon, Knox county Ohio about 35-45 miles from our house.\nSubmitted File 1:\n\nDate and time\n10\/27\/2017 10:00 PM "
	},
	"23": {
		"state": "Ohio",
		"state_abbrev": "OH",
		"location": "Scioto County",
		"longitude": -82.9931607,
		"latitude": 38.861065,
		"date": "3\/10\/2005",
		"summary": "3\/10\/2005 - Okay; this took a lot of courage because I’ve been ridiculed so much, for what happened to me. My grandfather owned a cabin. I’m not disclosing the location of it, due to the fact that I don’t want anything to happen to anyone. Anyway; my grandfather’s cabin was his way of getting the family together for the holidays, so he could have a nice Sunday dinner with all of us.\n\nOne day, all of a sudden, that all stopped abruptly. He wouldn’t allow anyone, but himself, to visit the cabin we all looked forward to going to and cherished. For years, I would ask him why he was doing that. He never told me why, but when he passed, he left the place to me. I inherited the cabin of my childhood and was ecstatic about that. It was soon after that, I realized why he did what he did. I would go out and walk the woods, on game trails, which are everywhere. I know these woods like I know my own home, so I never had any reason to fear them. It was on one of these walks that I encountered what people call “Dogmen.”\n\nI was walking, just like any other time. Nothing was different. It was then, on one of the game trails, I noticed an offshoot, small trail that went only 6 to 7 feet back. I could see that something had bedded down there. I thought it was a deer. I then walked in the bedded area. I soon realized that this was an ambush point for whatever made this bedded area and it was massive! My arm hairs stood erect and a chill literally ran down my spine! I felt as if I was being watched from different vantage points. Since it was nighttime, I had a tracking flashlight and my sidearm. The latter of which I drew and kept at the ready. I genuinely feared for my life at this point. All of a sudden, an ungodly growl was made to my right, about 10 to 15 yards from me (very close indeed). I pissed myself. It was so terrifying! I didn’t immediately run, fearing that whatever it was might take me as threatening. I turned and started heading back on the main trail and when I was about 5 minutes from the back door of my cabin, this thing let out a howl that I swear felt like it went right through my body! I then proceeded to run. As soon as I did, this thing was chasing me. For every 5 steps I took, this thing was taking 1. That’s how fast this Dogman was! I heard the sounds of branches being ripped off trees and I could have sworn I felt the vibrations of it running after me. I barely made it to my cabin and slammed the door, locking the 2 deadbolts and chain lock. I then turned on my spotlight and shined it into the tree line. There were 3 sets of eyes in the tree line that shined vivid yellow, with enormous, black pupils! I felt as if the thing could read my mind, but I’m not sure it could. All I know is that I’m alive and have since heard them many times, but I don’t take night hikes anymore and haven’t for years."
	},
	"24": {
		"state": "Ohio",
		"state_abbrev": "OH",
		"location": "Trotwood",
		"longitude": -84.3113334,
		"latitude": 39.7972788,
		"date": "8\/2\/1992",
		"summary": "Name:\nBrook\nReport Title:\nShiloh Springs Rd dogman\nDogman Sighting details::\nI am so frightened right now and it's hard to put these words down, I had to take a quick break, ,my encounter may seem mild compared to others,but it still physically shakes me to my core,,on a hot summer night in August of 92, me my mom and dad and 2 of my brothers decided we would get a papa Johns pizza and head to the Dixie twin drive in movie theatre, it 21st our payday family ritual, I have another older brother but he had moved out, after finishing our pizza and movies we headed out,but daddy decided to take a drive so he detoured to another part of town, we ended up on shiloh Springs Rd in what you would call Trotwood Ohio a suburb of Dayton, as we cruised along enjoying our latest night ride in noticed that there were no cars in front of or behind us,,it was all of a sudden eerie and dead silent, ,,as daddy drove up the Rd a little more information was looking out of the rear window and heard him say WHAT THE FUCK?? I turned around to look out of the front windshield and I was in horror, astonished, paralyzed, there aren't enough terrible words to describe the level of fear we were going through, ,, he slowed to a complete stop the headlights on our 79 Buick had caught this tall grey stringy haired thing with pointed ears and some kind of muzzle and yellow sort of gloiwing piercing eyes that made me feel like an ant,,I have never felt so inferior in all my life, he crossed the two lane road and disappeared into the woods in three steps, but not before looking through us like he wanted us to die,i felt pure hatred coming from this beast,he was mad at us for lookingat him,I keep saying him,but I honestly didn't see genitals, I guess I just felt that it was male,,he could have smashed through our car and destroyed our entire family, ,,I've seen my beloved daddy scared twice in his life and both times it was because he felt his death was coming, ,may he resting peace ,,this thing had a face not just an animal face it was like he was smart he was walking and he owned us for those few moments, finally my mom said RONNIE GO!! and he sped off,,I cried for a few minutes but after that something strange happened, it was like all 5 of us were entranced we were on some kind of auto pilot, we went home went to bed and totally blacked the incident out, like he put some kind of spell on us,,,we never even spoke of it again, but after I became a mother and wife my husband and I were talking about Bigfoot and I sat up and my memory snapped I said, ,,Brandon I think I saw Bigfoot and I told him the story he quickly corrected meandering said no,you didn't see Bigfoot you saw a werewolf, ,,I will never go camping or enter a forest or woods of any kind,nor do I allow my children to,that thing has supernatural powers and it let us know with his eyes that we were nothing and he would kill us in a second, this was 26 yearsago and I still am overcome with emotion and fear,,,I just wanted to share in hopes that it would make me feel better like maybe a weight would be lifted, I doubt it will though, ,thank you so much to anyone who takes the time to read my experience, \nSubmitted File 1:\n\nDate and time\n08\/2\/1992 1:00 AM "
	},
	"25": {
		"state": "Ohio",
		"state_abbrev": "OH",
		"location": "Trumbull County",
		"longitude": -80.7214417,
		"latitude": 41.3064984,
		"date": "12\/26\/2016",
		"summary": "12\/26\/2016 - I saw something on Monday night that still has me totally shaken to my very core. I have always loved nature… I love the woods, I love hiking and camping, fishing, I’m really into mycology so I’m out looking for mushrooms and various types of fungus whenever I get a chance. The weather was absolutely beautiful on Monday for this time of year, so towards evening time, I decided to round up some of my walleye gear and head down to an old train trestle crossing the Mahoning river in Niles, Ohio. I had parked my car about a mile and a half from the trestle so I could walk the tracks and hit a few other spots along the river on my way down there. By the time I reached the trestle, it was pretty much dark. I was wearing a headlamp at the time so I had a depending light source. At this location, there is a lake directly across the river, which the two are connected by a small overhead dam. I was there for 15 min when all of the sudden, this overwhelming feeling of dread came over me. I switched my headlamp on to turn around to start back up the river bank, and right behind a big sycamore tree, I saw what looked to be a VERY LARGE ANIMAL, kind of kneeling beside\/behind it. As I locked my eyes on it, I completely froze. I knew I was definitely seeing something there, but my mind couldn’t process it. What I was looking at didn’t make any fucking sense. The thing that I kept saying to myself was, “Animals aren’t supposed to look like that.” Right as I’m thinking this, it’s as if this thing read my mind, STOOD UP, and made itself perfectly visible in the most pretentious way. It almost had this vibe like, “Yeah, now you see me, you know I’m real, I definitely exist… What are you gonna do about it?” And as soon as it happened, it kind of hunched over and made its way into the brush. I was out of there LIKE A FLASH. As soon as my feet hit the tracks, I ran and ran the entire way back to my car, without stopping. By the time I reached my car, I couldn’t breathe. Both my legs were locked up. I was vomiting and somewhere in between the encounter and running away, I had pissed myself. It’s early Friday morning now, and I think I’ve only slept for about 6 or 7 hours altogether. I’ve been constantly searching YouTube and all kinds of stuff, listening to eyewitness accounts, and it sounds like these things are encountered quite often. I’ve heard of the “Dogman” before but never really took it seriously. Before the night of this encounter, I would always picture a dogman to look like some little skittish, coyote looking creature. Man… I love the woods and I love nature. The woods for me was always a safe haven I could venture into, to escape stress. Stress at work, bills, relationship problems… I could always take a nice long hike, go fishing or foraging and come home feeling 75% better. Now, I feel like I was threatened and kicked out if my second home. The only thing I can keep thinking is, these things aren’t supposed to exist. I feel like a terrified little kid who just came face to face with the dreaded “monster in the closet”. You know, the monster you parents told you, no wait, ASSURED YOU, wasn’t real and couldn’t hurt you. People need to be made aware of these things. They are as REAL as it gets and they are dangerous. Thinking back to what this thing looked like and how it was built, these things are perfectly adapted killing machines. The way the arms and legs looked, it looked like it was perfectly adapted to walk on all fours as well as on two legs, it was sooo quiet and fluent with its movements also. It’s not like in the movies where the monster comes charging out of the woods, growling and snarling, these things are are masters of camouflage and they utilize the darkness perfectly. I didn’t notice a smell from it, probably because the wind was on my back at the time, but it sure smelled me. Its nose was up in the air the whole time of our encounter, just sniffing away. This experience has torn a huge hole in me. Every time I eat, I get nauseous, I can’t sleep for more than 20 min. at a time, and every time I close my eyes, that thing is all I can see. I’m trying not to dwell in the fear, I’m trying to accept what I saw and what had happened, but it’s hard. I’m really glad I found this group and found a few things on YouTube, so I know I’m not alone."
	},
	"26": {
		"state": "Michigan",
		"state_abbrev": "MI",
		"location": "Oceana County",
		"longitude": -86.2895052,
		"latitude": 43.643476,
		"date": null,
		"summary": "My encounter happened in February 2009. In November 2008, I broke my arm and was basically stranded at home. I was unable to drive or work and was going stark, raving mad with boredom. My best friend would drive the 35 miles north from Muskegon, to pick me up in Shelby; just to take me back to Muskegon, for a visit at her home. She’d take me to dinner or out to see a movie, only to deliver me home to Shelby, after whichever activity. It was truly a selfless act of love.\n\nOne night, she was driving me home. It was very late, well after 11 pm. We were on US-31 Northbound, around the Rothbury area of Oceana County, on the expressway. Being February, in Michigan, the roads were naturally snowy, with scattered patches of ice and bare pavement. There was a small pickup truck in front of us, about 5 car lengths ahead of her car, when all of a sudden, we saw something on 2 legs dart out from the left, just in front of an overpass. It ran across the 2 lane highway and hit the back of the small pickup in the rear quarter-panel, causing the pickup to fishtail. Luckily, the driver of the small pickup regained control but they didn’t stop to see what collided with their truck. If anything, it seemed to pick-up speed and get the heck out of there. My friend and I watched in utter astonishment as the creature finished running to the right and disappeared into the weeds and trees along the highway. It didn’t even break stride after it hit the truck. We looked at one another, sat in silence for a moment, and then I said, “Did you see….?” She said, “Yea. I saw it….”\n\nWe finished the ride to my house in silence; both lost in our thoughts. It looked like a giant dog or wolf. It was on its hind legs; not all 4’s and it was at least 7 feet tall. It had pointed ears, a kind of mane around its neck ( much like a lion’s mane), was dark in color, and its hind legs looked like a dog’s, which was even more pronounced, as it was running only on its hind legs. It’s front legs were freely swinging as it ran and it seemed to have its mouth slightly open. It had an elongated face, very much like a collie face and a long nose protruding from its face. Its face was covered by longish hair. The entire creature seemed to be covered in long hair but I can’t recall if it had a tail. Something tells me it did but I can’t recall for certain, so I don’t want to say it did, when in fact, I’m not sure. We thought perhaps it may have been one of the Michigan Dogmen that are said to be in our area. Being a former Native American area, we have heard the stories but never met anyone that had a first-hand encounter. It was always someone who knew someone who knew someone who saw something. But now, my best friend and I definitely saw it. We had a first-hand experience. Our encounter was brief and over in a matter of mere moments but it was front and center of us and we saw it clear as a bell."
	},
	"27": {
		"state": "Michigan",
		"state_abbrev": "MI",
		"location": "Oceana County",
		"longitude": -86.2895052,
		"latitude": 43.643476,
		"date": null,
		"summary": "January 2016 - I encountered a bipedal wolf-like creature, here in western Michigan and it's got me spooked. I was out shoveling snow, as it's common here in my state. My encounter happened in a place just south of Rothbury, Michigan. I decided to take a walk in my family's woods, one day. That's when my life changed forever! My family owns 270 acres of land, here in the town\/city of Montague, Mi. I ventured out into those woods, as I've done many times (100's of them). The walk started as any one would. I started to follow the creek south, to check for deer stands, on our property. The walk went as planned, until I got about 300 yards south of the house. I stopped, to have a cigarette. My eyes started to wander, as I scoped for deer or coyote. As I gazed back and forth, I noticed this figure and froze. I literally froze! This thing made eye contact with me and then stood up. It was hairy, had very broad shoulders, and amber colored eyes. It let out a growl unlike any other I've heard. This wolf, as I call it, made two leaps and was gone. The most surprising thing about this encounter was how silent the woods were, up to when I had my encounter. So that you know, your episode 80 is what made me want to talk about this."
	},
	"28": {
		"state": "Michigan",
		"state_abbrev": "MI",
		"location": "Reed City",
		"longitude": -85.5100498,
		"latitude": 43.8750174,
		"date": null,
		"summary": "I was going to work in september 1995 and saw a 7 foot tall 375 lb creture run across us 10 near reed city michigan since then ive researched on my own and had another sighting..for more details of my encounters listen to dogman encounters episode 5..Ive since started 2 facebook groups International Dogman And Bigfoot research group and Dogman Believers only..dogman is real."
	}
}